#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
# =============================================================================
# Greek lexicon (within-clause verb movement)
# =============================================================================
"""

genders = ["m", "f"]
numbers = ["sing", "plur"]

# =============================================================================
# INITIALIZE CONTAINERS
# =============================================================================
# ~~~~~~
# DETERMINERS, HUMANS AND ADJECTIVES
# ~~~~~~
humans, adj, det = [{} for _ in range(3)]
for gender in genders:
    humans[gender] = {}
    adj[gender] = {}
    det[gender] = {}
    for number in numbers:
        humans[gender][number] = {}
        adj[gender][number] = {}
        det[gender][number] = {}

# ~~~~~~
# INANIMATE OBJECTS
# ~~~~~~
inanimate = [
    "τραπέζι",
    "καρέκλα",
    "πολυθρόνα",
    "καναπές",
    "καλοριφέρ",
    "τασάκι",
]
# ~~~~~~
# ADVERB
# ~~~~~~
adv = ["που"]

# =============================================================================
# POPULATE CONTAINERS
# =============================================================================

# ~~~~~~
# HUMANS
# ~~~~~~

human_sing_masculine = [
    "δάσκαλος",
    "μαθητής",
    "φοιτητής",
    "γυμναστής",
    "καθηγητής",
    "λογιστής",
    "μεταφραστής",
    "σχεδιαστής",
    "πωλητής",
    "κομμωτής",
    "νοσοκόμος",
    "χορευτής",
    "αθλητής",
    "μάγειρας",
    "εργάτης",
    "υποψήφιος",
    "ερευνητής",
    "διευθυντής",
    "προγραμματιστής",
    "σκηνοθέτης",
    "τραγουδιστής",
    "νοσηλευτής",
    "τεχνίτης",
    "ζαχαροπλάστης",
    "σερβιτόρος",
]
human_plur_masculine = [
    "δάσκαλοι",
    "μαθητές",
    "φοιτητές",
    "γυμναστές",
    "καθηγητές",
    "λογιστές",
    "μεταφραστές",
    "σχεδιαστές",
    "πωλητές",
    "κομμωτές",
    "νοσοκόμοι",
    "χορευτές",
    "αθλητες",
    "μάγειρες",
    "εργάτες",
    "υποψήφιοι",
    "ερευνητές",
    "διευθυντές",
    "προγραμματιστές",
    "σκηνοθέτες",
    "τραγουδιστές",
    "νοσηλευτές",
    "τεχνίτες",
    "ζαχαροπλάστες",
    "σερβιτόροι",
]


human_sing_feminine = [
    "δασκάλα",
    "μαθήτρια",
    "φοιτήτρια",
    "γυμνάστρια",
    "καθηγήτρια",
    "λογίστρια",
    "μεταφράστρια",
    "σχεδιάστρια",
    "πωλήτρια",
    "κομμώτρια",
    "νοσοκόμα",
    "χορεύτρια",
    "αθλήτρια",
    "μαγείρισσα",
    "εργάτρια",
    "υποψήφια",
    "ερευνήτρια",
    "διευθύντρια",
    "προγραμματίστρια",
    "σκηνοθέτρια",
    "τραγουδίστρια",
    "νοσηλεύτρια",
    "τεχνίτρια",
    "ζαχαροπλάστρια",
    "σερβιτόρα",
]


human_plur_feminine = [
    "δασκάλες",
    "μαθήτριες",
    "φοιτήτριες",
    "γυμνάστριες",
    "καθηγήτριες",
    "λογίστριες",
    "μεταφράστριες",
    "σχεδιάστριες",
    "πωλήτριες",
    "κομμώτριες",
    "νοσοκόμες",
    "χορεύτριες",
    "αθλήτριες",
    "μαγείρισσες",
    "εργάτριες",
    "υποψήφιες",
    "ερευνήτριες",
    "διευθύντριες",
    "προγραμματίστριες",
    "σκηνοθέτριες",
    "τραγουδίστριες",
    "νοσηλεύτριες",
    "τεχνίτριες",
    "ζαχαροπλάστριες",
    "σερβιτόρες",
]


humans["m"]["sing"] = human_sing_masculine
humans["m"]["plur"] = human_plur_masculine

humans["f"]["sing"] = human_sing_feminine
humans["f"]["plur"] = human_plur_feminine

# ~~~~~~
# DET
# ~~~~~~
det["m"]["sing"] = ["ο"]
det["m"]["plur"] = ["οι"]

det["f"]["sing"] = ["η"]
det["f"]["plur"] = ["οι"]


# ~~~~~~
# VERBS
# ~~~~~~
verb_intr_sing = [
    "φεύγει",
    "κλαίει",
    "σκέφτεται",  # ?
    "γελάει",
    "βήχει",
    "πονάει",
]

verb_intr_plur = [
    "φεύγουν",
    "κλαίνε",
    "σκέφτονται",  # ?
    "γελάνε",
    "βήχουν",
    "πονάνε",
]


verb_tran_sing = [
    "συμπαθεί",
    "αντιπαθεί",
    "αγαπάει",  # ?
    "μισεί",
    "γνωρίζει",
    "θαυμάζει",
    # "προτιμά",
    "εκτιμά",
]

verb_tran_plur = [
    "συμπαθούν",
    "αντιπαθούν",
    "αγαπούν",  # ?
    "μισούν",
    "γνωρίζουν",
    "θαυμάζουν",
    # "προτιμούν",
    "εκτιμούν",
]

verbs = {"intr": {}, "tran": {}}
verbs["intr"]["sing"] = verb_intr_sing
verbs["intr"]["plur"] = verb_intr_plur

verbs["tran"]["sing"] = verb_tran_sing
verbs["tran"]["plur"] = verb_tran_plur


words = {
    "verbs": verbs,
    "humans": humans,
    "det": det,
    "adj": adj,
    "adv": adv,
    "inanimate": inanimate,
}
